{
    "data_dir":"/public/home/huhang/CHGAT/data/",
    "chinese_bert_path":"/public/home/huhang/genderPrediction/BERT/chinese_L-12_H-768_A-12/",
    "output_dir":"/public/home/huhang/SPPGAT/results/",
    "max_length": 150,
    "train_batch_size": 8,
    "dev_batch_size": 8,
    "test_batch_size": 8,
    "device": "cuda",
    "learning_rate": 0.000002,
    "num_train_epochs": 6,
    "checkpoint": 600,
    "export_model": true,
    "output_size": 768,
    "tokenized": false,
    "flag":"train",
    "weight_decay":0.05,
    "num_attention_heads":6,
    "dropout":0.2,
    "earlystop":10,
    "random_seed":0,
    "chinese_bert_config":{
        "attention_probs_dropout_prob": 0.1,
        "classifier_dropout": null,
        "directionality": "bidi",
        "hidden_act": "gelu",
        "hidden_dropout_prob": 0.1,
        "hidden_size": 768,
        "initializer_range": 0.02,
        "intermediate_size": 3072,
        "layer_norm_eps": 1e-12,
        "max_position_embeddings": 512,
        "model_type": "bert",
        "num_attention_heads": 12,
        "num_hidden_layers": 12,
        "pad_token_id": 0,
        "pooler_fc_size": 768,
        "pooler_num_attention_heads": 12,
        "pooler_num_fc_layers": 3,
        "pooler_size_per_head": 128,
        "pooler_type": "first_token_transform",
        "position_embedding_type": "absolute",
        "transformers_version": "4.14.1",
        "type_vocab_size": 2,
        "use_cache": true,
        "vocab_size": 21128
    },
    "transformer_config": {
        "max_position_embeddings": 512,
        "attention_probs_dropout_prob": 0.5,
        "directionality": "bidi",
        "hidden_act": "gelu",
        "hidden_dropout_prob": 0.5,
        "hidden_size": 1536,
        "initializer_range": 0.02,
        "intermediate_size": 6144,
        "num_attention_heads": 12,
        "num_hidden_layers": 2,
        "pooler_fc_size": 1536,
        "pooler_num_attention_heads": 12,
        "pooler_num_fc_layers": 2,
        "pooler_size_per_head": 256,
        "pooler_type": "first_token_transform",
        "type_vocab_size": 2,
        "vocab_size": 21128
    }
}